{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 17, 256, 256], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution2d_1"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_1"}, "inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "leakyrelu_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_1", 0, 0]]], "name": "convolution2d_2"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_1", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "batchnormalization_1"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_2"}, "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "name": "leakyrelu_2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_2", 0, 0]]], "name": "convolution2d_3"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_2", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "batchnormalization_2"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_3"}, "inbound_nodes": [[["batchnormalization_2", 0, 0]]], "name": "leakyrelu_3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_4", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_3", 0, 0]]], "name": "convolution2d_4"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_3", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_4", 0, 0]]], "name": "batchnormalization_3"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_4"}, "inbound_nodes": [[["batchnormalization_3", 0, 0]]], "name": "leakyrelu_4"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_5", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_4", 0, 0]]], "name": "convolution2d_5"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_4", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_5", 0, 0]]], "name": "batchnormalization_4"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_5"}, "inbound_nodes": [[["batchnormalization_4", 0, 0]]], "name": "leakyrelu_5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_6", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_5", 0, 0]]], "name": "convolution2d_6"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_5", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_6", 0, 0]]], "name": "batchnormalization_5"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_6"}, "inbound_nodes": [[["batchnormalization_5", 0, 0]]], "name": "leakyrelu_6"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_7", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_6", 0, 0]]], "name": "convolution2d_7"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_6", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_7", 0, 0]]], "name": "batchnormalization_6"}, {"class_name": "LeakyReLU", "config": {"alpha": 0.2, "trainable": true, "name": "leakyrelu_7"}, "inbound_nodes": [[["batchnormalization_6", 0, 0]]], "name": "leakyrelu_7"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_8", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["leakyrelu_7", 0, 0]]], "name": "convolution2d_8"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_7", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_8", 0, 0]]], "name": "batchnormalization_7"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["batchnormalization_7", 0, 0]]], "name": "activation_1"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_1", "size": [2, 2]}, "inbound_nodes": [[["activation_1", 0, 0]]], "name": "upsampling2d_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_9", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["upsampling2d_1", 0, 0]]], "name": "convolution2d_9"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_8", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_9", 0, 0]]], "name": "batchnormalization_8"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["batchnormalization_8", 0, 0]]], "name": "dropout_1"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["dropout_1", 0, 0], ["batchnormalization_6", 0, 0]]], "name": "merge_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "activation_2"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_2", "size": [2, 2]}, "inbound_nodes": [[["activation_2", 0, 0]]], "name": "upsampling2d_2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_10", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["upsampling2d_2", 0, 0]]], "name": "convolution2d_10"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_9", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_10", 0, 0]]], "name": "batchnormalization_9"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["batchnormalization_9", 0, 0]]], "name": "dropout_2"}, {"class_name": "Merge", "config": {"name": "merge_2", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["dropout_2", 0, 0], ["batchnormalization_5", 0, 0]]], "name": "merge_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "inbound_nodes": [[["merge_2", 0, 0]]], "name": "activation_3"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_3", "size": [2, 2]}, "inbound_nodes": [[["activation_3", 0, 0]]], "name": "upsampling2d_3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_11", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 512, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["upsampling2d_3", 0, 0]]], "name": "convolution2d_11"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_10", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_11", 0, 0]]], "name": "batchnormalization_10"}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}, "inbound_nodes": [[["batchnormalization_10", 0, 0]]], "name": "dropout_3"}, {"class_name": "Merge", "config": {"name": "merge_3", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["dropout_3", 0, 0], ["batchnormalization_4", 0, 0]]], "name": "merge_3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "inbound_nodes": [[["merge_3", 0, 0]]], "name": "activation_4"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_4", "size": [2, 2]}, "inbound_nodes": [[["activation_4", 0, 0]]], "name": "upsampling2d_4"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_12", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["upsampling2d_4", 0, 0]]], "name": "convolution2d_12"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_11", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_12", 0, 0]]], "name": "batchnormalization_11"}, {"class_name": "Merge", "config": {"name": "merge_4", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["batchnormalization_11", 0, 0], ["batchnormalization_3", 0, 0]]], "name": "merge_4"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "inbound_nodes": [[["merge_4", 0, 0]]], "name": "activation_5"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_5", "size": [2, 2]}, "inbound_nodes": [[["activation_5", 0, 0]]], "name": "upsampling2d_5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_13", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["upsampling2d_5", 0, 0]]], "name": "convolution2d_13"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_12", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_13", 0, 0]]], "name": "batchnormalization_12"}, {"class_name": "Merge", "config": {"name": "merge_5", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["batchnormalization_12", 0, 0], ["batchnormalization_2", 0, 0]]], "name": "merge_5"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "inbound_nodes": [[["merge_5", 0, 0]]], "name": "activation_6"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_6", "size": [2, 2]}, "inbound_nodes": [[["activation_6", 0, 0]]], "name": "upsampling2d_6"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_14", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["upsampling2d_6", 0, 0]]], "name": "convolution2d_14"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_13", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_14", 0, 0]]], "name": "batchnormalization_13"}, {"class_name": "Merge", "config": {"name": "merge_6", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["batchnormalization_13", 0, 0], ["batchnormalization_1", 0, 0]]], "name": "merge_6"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "inbound_nodes": [[["merge_6", 0, 0]]], "name": "activation_7"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_7", "size": [2, 2]}, "inbound_nodes": [[["activation_7", 0, 0]]], "name": "upsampling2d_7"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_15", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["upsampling2d_7", 0, 0]]], "name": "convolution2d_15"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_14", "epsilon": 0.001, "trainable": true, "mode": 2, "beta_regularizer": null, "momentum": 0.99, "axis": 1}, "inbound_nodes": [[["convolution2d_15", 0, 0]]], "name": "batchnormalization_14"}, {"class_name": "Merge", "config": {"name": "merge_7", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["batchnormalization_14", 0, 0], ["convolution2d_1", 0, 0]]], "name": "merge_7"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}, "inbound_nodes": [[["merge_7", 0, 0]]], "name": "activation_8"}, {"class_name": "UpSampling2D", "config": {"trainable": true, "name": "upsampling2d_8", "size": [2, 2]}, "inbound_nodes": [[["activation_8", 0, 0]]], "name": "upsampling2d_8"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "last_conv", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 10, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "linear", "nb_row": 3}, "inbound_nodes": [[["upsampling2d_8", 0, 0]]], "name": "last_conv"}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_9"}, "inbound_nodes": [[["last_conv", 0, 0]]], "name": "activation_9"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["activation_9", 0, 0]], "name": "U-net"}}